In [7]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [4]:
%%sql

SELECT * 
 FROM facts 
 LIMIT 2;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3)]

In [8]:
%%sql

SELECT *
 FROM sqlite_master
 WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [9]:
%%sql

SELECT *
 FROM facts
 LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [10]:
%%sql

SELECT 
 MIN(population) AS min_pop, 
 MAX(population) AS  max_pop,
 MIN(population_growth) AS min_pop_grw,
 MAX(population_growth) AS max_pop_grw
 FROM facts

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [13]:
%%sql

SELECT name FROM facts WHERE population = (SELECT MIN(population) FROM facts)

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [16]:
%%sql

SELECT name FROM facts WHERE population = (SELECT MAX(population) FROM facts)

 * sqlite:///factbook.db
Done.

[('China',)]

In [17]:
%%sql

SELECT 
 MIN(population) AS min_pop, 
 MAX(population) AS  max_pop,
 MIN(population_growth) AS min_pop_grw,
 MAX(population_growth) AS max_pop_grw
 FROM facts
 WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [19]:
%%sql

SELECT 
 AVG(population) AS avg_pop, 
 AVG(area) AS  avg_area
 FROM facts
 WHERE name <> 'World'

 * sqlite:///factbook.db
Done.

[(32242666.56846473, 555093.546184739)]

In [ ]:
%%sql

SELECT name
 FROM facts
 WHERE 
 population > (SELECT AVG(population) FROM facts WHERE name <> 'World')
 and
 area > (SELECT AVG(area) FROM facts WHERE name <> 'World')